In [1]:
import pandas as pd

In [2]:
data=pd.read_csv("./Data/practice_data.csv")

In [3]:
data

      Name  Gender       City   Age   Salary  Experience Passed
0     Aman    Male      Delhi  25.0  50000.0         2.0    Yes
1     Riya  Female     Mumbai   NaN  60000.0         3.0    Yes
2    Rahul    Male  Bangalore  23.0  45000.0         1.0     No
3   Anjali  Female      Delhi  28.0      NaN         4.0    Yes
4    Karan    Male    Chennai  35.0  80000.0         8.0    Yes
5    Pooja  Female     Mumbai  22.0  38000.0         NaN     No
6    Arjun    Male  Bangalore  30.0  70000.0         5.0    Yes
7     Neha  Female    Chennai  27.0  62000.0         3.0    Yes
8    Rohit    Male      Delhi   NaN  52000.0         2.0     No
9    Sneha  Female  Bangalore  24.0  48000.0         1.0    Yes
10   Imran    Male     Mumbai  32.0  75000.0         6.0     No
11    Isha  Female      Delhi  26.0      NaN         3.0    Yes
12   Kabir    Male    Chennai  29.0  68000.0         4.0    Yes
13  Simran  Female     Mumbai  23.0  42000.0         1.0     No

In [4]:
data.isnull().sum()

Name          0
Gender        0
City          0
Age           2
Salary        2
Experience    1
Passed        0
dtype: int64

In [5]:
data["Salary"]=data["Salary"].fillna(data["Salary"].mean())
data["Experience"]=data["Experience"].fillna(data["Experience"].mean())
data["Age"]=data["Age"].fillna(data["Age"].mean())

In [6]:
data

      Name  Gender       City   Age   Salary  Experience Passed
0     Aman    Male      Delhi  25.0  50000.0    2.000000    Yes
1     Riya  Female     Mumbai  27.0  60000.0    3.000000    Yes
2    Rahul    Male  Bangalore  23.0  45000.0    1.000000     No
3   Anjali  Female      Delhi  28.0  57500.0    4.000000    Yes
4    Karan    Male    Chennai  35.0  80000.0    8.000000    Yes
5    Pooja  Female     Mumbai  22.0  38000.0    3.307692     No
6    Arjun    Male  Bangalore  30.0  70000.0    5.000000    Yes
7     Neha  Female    Chennai  27.0  62000.0    3.000000    Yes
8    Rohit    Male      Delhi  27.0  52000.0    2.000000     No
9    Sneha  Female  Bangalore  24.0  48000.0    1.000000    Yes
10   Imran    Male     Mumbai  32.0  75000.0    6.000000     No
11    Isha  Female      Delhi  26.0  57500.0    3.000000    Yes
12   Kabir    Male    Chennai  29.0  68000.0    4.000000    Yes
13  Simran  Female     Mumbai  23.0  42000.0    1.000000     No

In [7]:
data.isnull().sum()

Name          0
Gender        0
City          0
Age           0
Salary        0
Experience    0
Passed        0
dtype: int64

In [8]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()

In [9]:
data["GenderEncoded"]=le.fit_transform(data["Gender"])
data["PassedEncoded"]=le.fit_transform(data["Passed"])

In [10]:
data

,Name,Gender,City,Age,Salary,Experience,Passed,GenderEncoded,PassedEncoded
0,Aman,Male,Delhi,25.0,50000.0,2.000000,Yes,1,1
1,Riya,Female,Mumbai,27.0,60000.0,3.000000,Yes,0,1
2,Rahul,Male,Bangalore,23.0,45000.0,1.000000,No,1,0
3,Anjali,Female,Delhi,28.0,57500.0,4.000000,Yes,0,1
4,Karan,Male,Chennai,35.0,80000.0,8.000000,Yes,1,1
5,Pooja,Female,Mumbai,22.0,38000.0,3.307692,No,0,0
6,Arjun,Male,Bangalore,30.0,70000.0,5.000000,Yes,1,1
7,Neha,Female,Chennai,27.0,62000.0,3.000000,Yes,0,1
8,Rohit,Male,Delhi,27.0,52000.0,2.000000,No,1,0
9,Sneha,Female,Bangalore,24.0,48000.0,1.000000,Yes,0,1
10,Imran,Male,Mumbai,32.0,75000.0,6.000000,No,1,0
11,Isha,Female,Delhi,26.0,57500.0,3.000000,Yes,0,1
12,Kabir,Male,Chennai,29.0,68000.0,4.000000,Yes,1,1
13,Simran,Female,Mumbai,23.0,42000.0,1.000000,No,0,0

In [11]:
Encoded_data=pd.get_dummies(data,columns=["City"],dtype=int)

In [12]:
pre_data=Encoded_data[["Name","GenderEncoded","Age","Salary","Experience","PassedEncoded","City_Bangalore","City_Chennai","City_Delhi","City_Mumbai"]]

In [13]:
pre_data

,Name,GenderEncoded,Age,Salary,Experience,PassedEncoded,City_Bangalore,City_Chennai,City_Delhi,City_Mumbai
0,Aman,1,25.0,50000.0,2.000000,1,0,0,1,0
1,Riya,0,27.0,60000.0,3.000000,1,0,0,0,1
2,Rahul,1,23.0,45000.0,1.000000,0,1,0,0,0
3,Anjali,0,28.0,57500.0,4.000000,1,0,0,1,0
4,Karan,1,35.0,80000.0,8.000000,1,0,1,0,0
5,Pooja,0,22.0,38000.0,3.307692,0,0,0,0,1
6,Arjun,1,30.0,70000.0,5.000000,1,1,0,0,0
7,Neha,0,27.0,62000.0,3.000000,1,0,1,0,0
8,Rohit,1,27.0,52000.0,2.000000,0,0,0,1,0
9,Sneha,0,24.0,48000.0,1.000000,1,1,0,0,0
10,Imran,1,32.0,75000.0,6.000000,0,0,0,0,1
11,Isha,0,26.0,57500.0,3.000000,1,0,0,1,0
12,Kabir,1,29.0,68000.0,4.000000,1,0,1,0,0
13,Simran,0,23.0,42000.0,1.000000,0,0,0,0,1

In [14]:
from sklearn.preprocessing import StandardScaler
scaler=StandardScaler()

In [15]:
Standard_scaled=scaler.fit_transform(pre_data[["Age","Salary","Experience"]])

In [16]:
pd.DataFrame(Standard_scaled,columns=["Age","Salary","Experience"])

         Age    Salary  Experience
0  -0.567309 -0.618439   -0.673565
1   0.000000  0.206146   -0.158486
2  -1.134617 -1.030732   -1.188643
3   0.283654  0.000000    0.356593
4   2.269235  1.855318    2.416908
5  -1.418272 -1.607942    0.000000
6   0.850963  1.030732    0.871672
7   0.000000  0.371064   -0.158486
8   0.000000 -0.453522   -0.673565
9  -0.850963 -0.783356   -1.188643
10  1.418272  1.443025    1.386750
11 -0.283654  0.000000   -0.158486
12  0.567309  0.865815    0.356593
13 -1.134617 -1.278108   -1.188643

In [17]:
pre_data

,Name,GenderEncoded,Age,Salary,Experience,PassedEncoded,City_Bangalore,City_Chennai,City_Delhi,City_Mumbai
0,Aman,1,25.0,50000.0,2.000000,1,0,0,1,0
1,Riya,0,27.0,60000.0,3.000000,1,0,0,0,1
2,Rahul,1,23.0,45000.0,1.000000,0,1,0,0,0
3,Anjali,0,28.0,57500.0,4.000000,1,0,0,1,0
4,Karan,1,35.0,80000.0,8.000000,1,0,1,0,0
5,Pooja,0,22.0,38000.0,3.307692,0,0,0,0,1
6,Arjun,1,30.0,70000.0,5.000000,1,1,0,0,0
7,Neha,0,27.0,62000.0,3.000000,1,0,1,0,0
8,Rohit,1,27.0,52000.0,2.000000,0,0,0,1,0
9,Sneha,0,24.0,48000.0,1.000000,1,1,0,0,0
10,Imran,1,32.0,75000.0,6.000000,0,0,0,0,1
11,Isha,0,26.0,57500.0,3.000000,1,0,0,1,0
12,Kabir,1,29.0,68000.0,4.000000,1,0,1,0,0
13,Simran,0,23.0,42000.0,1.000000,0,0,0,0,1

In [18]:
unscaled=pre_data[["GenderEncoded","PassedEncoded","City_Bangalore","City_Chennai","City_Delhi","City_Mumbai"]]

In [19]:
scaled=pd.DataFrame(Standard_scaled,columns=["Age","Salary","Experience"])

In [20]:
combined_df = pd.concat([scaled,unscaled], axis=1)

In [21]:
combined_df

,Age,Salary,Experience,GenderEncoded,PassedEncoded,City_Bangalore,City_Chennai,City_Delhi,City_Mumbai
0,-0.567309,-0.618439,-0.673565,1,1,0,0,1,0
1,0.000000,0.206146,-0.158486,0,1,0,0,0,1
2,-1.134617,-1.030732,-1.188643,1,0,1,0,0,0
3,0.283654,0.000000,0.356593,0,1,0,0,1,0
4,2.269235,1.855318,2.416908,1,1,0,1,0,0
5,-1.418272,-1.607942,0.000000,0,0,0,0,0,1
6,0.850963,1.030732,0.871672,1,1,1,0,0,0
7,0.000000,0.371064,-0.158486,0,1,0,1,0,0
8,0.000000,-0.453522,-0.673565,1,0,0,0,1,0
9,-0.850963,-0.783356,-1.188643,0,1,1,0,0,0
10,1.418272,1.443025,1.386750,1,0,0,0,0,1
11,-0.283654,0.000000,-0.158486,0,1,0,0,1,0
12,0.567309,0.865815,0.356593,1,1,0,1,0,0
13,-1.134617,-1.278108,-1.188643,0,0,0,0,0,1

In [22]:
from sklearn.model_selection import train_test_split
X=combined_df[["Age","Salary","Experience","GenderEncoded","City_Bangalore","City_Chennai","City_Delhi","City_Mumbai"]]
y=combined_df[["PassedEncoded"]]

In [23]:
X_train,X_test, y_train,y_test=train_test_split(X, y, test_size=0.2,random_state=42)

In [24]:
X_train

,Age,Salary,Experience,GenderEncoded,City_Bangalore,City_Chennai,City_Delhi,City_Mumbai
12,0.567309,0.865815,0.356593,1,0,1,0,0
5,-1.418272,-1.607942,0.000000,0,0,0,0,1
8,0.000000,-0.453522,-0.673565,1,0,0,1,0
2,-1.134617,-1.030732,-1.188643,1,1,0,0,0
1,0.000000,0.206146,-0.158486,0,0,0,0,1
13,-1.134617,-1.278108,-1.188643,0,0,0,0,1
4,2.269235,1.855318,2.416908,1,0,1,0,0
7,0.000000,0.371064,-0.158486,0,0,1,0,0
10,1.418272,1.443025,1.386750,1,0,0,0,1
3,0.283654,0.000000,0.356593,0,0,0,1,0
6,0.850963,1.030732,0.871672,1,1,0,0,0